Спортклуб/src/Documents/ЗаморозкаАбонемента/ЗаморозкаАбонемента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаморозкаАбонемента</name>
  <attributes>
    <name>Абонемент</name>
    <type>
      <types>DocumentRef.ПродажаАбонемента</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОканчания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Document>

Спортклуб/src/InformationRegisters/СостояниеАбонемента/СостояниеАбонемента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостояниеАбонемента</name>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусАбонемента</types>
    </type>
  </resources>
  <resources>
    <name>ОстатокПосещений</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДоступноЗаморозок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Абонемент</name>
    <type>
      <types>DocumentRef.ПродажаАбонемента</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Спортклуб/src/Enums/СтатусАбонемента/СтатусАбонемента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусАбонемента</name>
  <enumValues>
    <name>Активен</name>
  </enumValues>
  <enumValues>
    <name>Закончился</name>
  </enumValues>
  <enumValues>
    <name>Заморожен</name>
  </enumValues>
</mdclass:Enum>

Спортклуб/src/Documents/ЗаморозкаАбонемента/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПриЗаписи(Отказ)
    
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|    СостояниеАбонемента.Статус КАК Статус,
	|    СостояниеАбонемента.ДоступноЗаморозок КАК ДоступноЗаморозок,
	|    ПродажаАбонемента.Абонементы.ВозможностьЗаморозки КАК ВозможностьЗаморозки
	|ИЗ
	|    Документ.ПродажаАбонемента КАК ПродажаАбонемента
	|        ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостояниеАбонемента КАК СостояниеАбонемента
	|        ПО ПродажаАбонемента.Ссылка = СостояниеАбонемента.Абонемент
	|ГДЕ
	|    ПродажаАбонемента.Ссылка = &Абонемент";
    
	Запрос.УстановитьПараметр("Абонемент", Объект.Абонемент);
	Результат = Запрос.Выполнить().Выбрать();
    
	Если Результат.Следующий() Тогда
		Если НЕ Результат.ВозможностьЗаморозки Тогда
			Отказ = Истина;
			Сообщить("Данный абонемент не поддерживает заморозку");
			Возврат;
        КонецЕсли;
        
        Если Результат.Статус <> Перечисления.СтатусАбонемента.Активен Тогда
			Отказ = Истина;
			Сообщить("Заморозка возможна для активных абонементов!");
			Возврат;
        КонецЕсли;
        
        Если Результат.ДоступноЗаморозок <= 0 Тогда
			Отказ = Истина;
			Сообщить("Лимит заморозок исчерпан!");
			Возврат;
        КонецЕсли;
        
		НаборЗаписей = РегистрыСведений.СостояниеАбонемента.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Абонемент.Установить(Объект.Абонемент);
        
		Если НаборЗаписей.Найти() Тогда
			Запись = НаборЗаписей.Текущая;
			Запись.Статус = Перечисления.СтатусАбонемента.Заморожен;
			Запись.ДатаИзмененияСтатуса = ТекущаяДата();
			Запись.ДоступноЗаморозок = Запись.ДоступноЗаморозок - 1;
			НаборЗаписей.Записать();
		КонецЕсли;
	КонецЕсли;
    
КонецПроцедуры

&НаСервере
Процедура ДатаНачалаПриИзмененииНаСервере()
    
	Если Объект.ДатаНачала <> Неопределено Тогда
		Объект.ДатаОкончания = КонецДня(Объект.ДатаНачала + 90);
    КонецЕсли;
    
КонецПроцедуры
